read_verilog test.v 
hierarchy -check -top test; proc; opt; check -assert
write_smt2 -tpl proof.tpl proof.smt2