read_verilog alu_slow.v 
hierarchy -check -top alu; proc; opt; check -assert
proc; opt
techmap; opt; flatten
write_smt2 -tpl alu_proof.tpl alu_proof_slow.smt2
